Tekla Open API Reference for Tekla Structures 2025
SpiralBeam.Insert Method
 Inserts the spiral beam into the model database. All the attributes must be set.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Insert()
Public Overrides Function Insert As Boolean
Return Value
Type: Boolean
True on success.
Exceptions
Exception | Condition
SpiralBeamDataException | Throws exception if input data is invalid.
See Also
Reference
SpiralBeam Class
Tekla.Structures.Model Namespace